app/controllers/global_links_controller.rb

  def index
    @global_links = GlobalLink.all
---
SELECT "global_links".* FROM "global_links"

    def set_global_link
      @global_link = GlobalLink.find(params[:id])
---
SELECT  "global_links".* FROM "global_links" WHERE "global_links"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]