app/controllers/tier_two_links_controller.rb

  def index
    @global_links = GlobalLink.all
    @tier_two_links = TierTwoLink.all
---
SELECT "tier_two_links".* FROM "tier_two_links"