app/controllers/tier_one_links_controller.rb

  def index
    @global_links = GlobalLink.all
    @tier_one_links = TierOneLink.all
---
SELECT "global_links".* FROM "global_links"
SELECT "tier_one_links".* FROM "tier_one_links"

    def set_tier_one_link
      @tier_one_link = TierOneLink.find(params[:id])
---
SELECT  "tier_one_links".* FROM "tier_one_links" WHERE "tier_one_links"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]