app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "global_links".* FROM "global_links"
---
  def index
    @users = User.all
    @global_links = GlobalLink.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 1], ["updated_at", "2018-11-21 09:04:30.454219"], ["id", 3]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(secure_params)